const AreaList = [{
    "name": "华北地区",
    "range": [100000, 160000],
    "list": [{
        "id": "110000",
        "name": "北京",
        "parent_id": "0",
        "sub": {"110100": {"id": "110100", "name": "北京市", "parent_id": "110000"}}
    }, {
        "id": "120000",
        "name": "天津",
        "parent_id": "0",
        "sub": {
            "120100": {
                "id": "120100",
                "name": "天津市",
                "parent_id": "120000",
                "sub": {"120216": {"id": "120216", "name": "滨海新区", "parent_id": "120100"}}
            }
        }
    }, {
        "id": "130000",
        "name": "河北",
        "parent_id": "0",
        "sub": {
            "130100": {"id": "130100", "name": "石家庄市", "parent_id": "130000"},
            "130200": {"id": "130200", "name": "唐山市", "parent_id": "130000"},
            "130300": {"id": "130300", "name": "秦皇岛市", "parent_id": "130000"},
            "130400": {"id": "130400", "name": "邯郸市", "parent_id": "130000"},
            "130500": {"id": "130500", "name": "邢台市", "parent_id": "130000"},
            "130600": {"id": "130600", "name": "保定市", "parent_id": "130000"},
            "130700": {"id": "130700", "name": "张家口市", "parent_id": "130000"},
            "130800": {"id": "130800", "name": "承德市", "parent_id": "130000"},
            "130900": {"id": "130900", "name": "沧州市", "parent_id": "130000"},
            "131000": {"id": "131000", "name": "廊坊市", "parent_id": "130000"},
            "131100": {"id": "131100", "name": "衡水市", "parent_id": "130000"}
        }
    }, {
        "id": "140000",
        "name": "山西",
        "parent_id": "0",
        "sub": {
            "140100": {"id": "140100", "name": "太原市", "parent_id": "140000"},
            "140200": {"id": "140200", "name": "大同市", "parent_id": "140000"},
            "140300": {"id": "140300", "name": "阳泉市", "parent_id": "140000"},
            "140400": {"id": "140400", "name": "长治市", "parent_id": "140000"},
            "140500": {"id": "140500", "name": "晋城市", "parent_id": "140000"},
            "140600": {"id": "140600", "name": "朔州市", "parent_id": "140000"},
            "140700": {"id": "140700", "name": "晋中市", "parent_id": "140000"},
            "140800": {"id": "140800", "name": "运城市", "parent_id": "140000"},
            "140900": {"id": "140900", "name": "忻州市", "parent_id": "140000"},
            "141000": {"id": "141000", "name": "临汾市", "parent_id": "140000"},
            "141100": {"id": "141100", "name": "吕梁市", "parent_id": "140000"}
        }
    }, {
        "id": "150000",
        "name": "内蒙古",
        "parent_id": "0",
        "sub": {
            "150100": {"id": "150100", "name": "呼和浩特市", "parent_id": "150000"},
            "150200": {"id": "150200", "name": "包头市", "parent_id": "150000"},
            "150300": {"id": "150300", "name": "乌海市", "parent_id": "150000"},
            "150400": {"id": "150400", "name": "赤峰市", "parent_id": "150000"},
            "150500": {"id": "150500", "name": "通辽市", "parent_id": "150000"},
            "150600": {"id": "150600", "name": "鄂尔多斯市", "parent_id": "150000"},
            "150700": {"id": "150700", "name": "呼伦贝尔市", "parent_id": "150000"},
            "150800": {"id": "150800", "name": "巴彦淖尔市", "parent_id": "150000"},
            "150900": {"id": "150900", "name": "乌兰察布市", "parent_id": "150000"},
            "152200": {"id": "152200", "name": "兴安盟", "parent_id": "150000"},
            "152500": {"id": "152500", "name": "锡林郭勒盟", "parent_id": "150000"},
            "152900": {"id": "152900", "name": "阿拉善盟", "parent_id": "150000"}
        }
    }]
}, {
    "name": "东北地区",
    "range": [200000, 240000],
    "list": [{
        "id": "210000",
        "name": "辽宁",
        "parent_id": "0",
        "sub": {
            "210100": {"id": "210100", "name": "沈阳市", "parent_id": "210000"},
            "210200": {"id": "210200", "name": "大连市", "parent_id": "210000"},
            "210300": {"id": "210300", "name": "鞍山市", "parent_id": "210000"},
            "210400": {"id": "210400", "name": "抚顺市", "parent_id": "210000"},
            "210500": {"id": "210500", "name": "本溪市", "parent_id": "210000"},
            "210600": {"id": "210600", "name": "丹东市", "parent_id": "210000"},
            "210700": {"id": "210700", "name": "锦州市", "parent_id": "210000"},
            "210800": {"id": "210800", "name": "营口市", "parent_id": "210000"},
            "210900": {"id": "210900", "name": "阜新市", "parent_id": "210000"},
            "211000": {"id": "211000", "name": "辽阳市", "parent_id": "210000"},
            "211100": {"id": "211100", "name": "盘锦市", "parent_id": "210000"},
            "211200": {"id": "211200", "name": "铁岭市", "parent_id": "210000"},
            "211300": {"id": "211300", "name": "朝阳市", "parent_id": "210000"},
            "211400": {"id": "211400", "name": "葫芦岛市", "parent_id": "210000"}
        }
    }, {
        "id": "220000",
        "name": "吉林",
        "parent_id": "0",
        "sub": {
            "220100": {"id": "220100", "name": "长春市", "parent_id": "220000"},
            "220200": {"id": "220200", "name": "吉林市", "parent_id": "220000"},
            "220300": {"id": "220300", "name": "四平市", "parent_id": "220000"},
            "220400": {"id": "220400", "name": "辽源市", "parent_id": "220000"},
            "220500": {"id": "220500", "name": "通化市", "parent_id": "220000"},
            "220600": {"id": "220600", "name": "白山市", "parent_id": "220000"},
            "220700": {"id": "220700", "name": "松原市", "parent_id": "220000"},
            "220800": {"id": "220800", "name": "白城市", "parent_id": "220000"},
            "222400": {"id": "222400", "name": "延边朝鲜族自治州", "parent_id": "220000"}
        }
    }, {
        "id": "230000",
        "name": "黑龙江",
        "parent_id": "0",
        "sub": {
            "230100": {"id": "230100", "name": "哈尔滨市", "parent_id": "230000"},
            "230200": {"id": "230200", "name": "齐齐哈尔市", "parent_id": "230000"},
            "230300": {"id": "230300", "name": "鸡西市", "parent_id": "230000"},
            "230400": {"id": "230400", "name": "鹤岗市", "parent_id": "230000"},
            "230500": {"id": "230500", "name": "双鸭山市", "parent_id": "230000"},
            "230600": {"id": "230600", "name": "大庆市", "parent_id": "230000"},
            "230700": {"id": "230700", "name": "伊春市", "parent_id": "230000"},
            "230800": {"id": "230800", "name": "佳木斯市", "parent_id": "230000"},
            "230900": {"id": "230900", "name": "七台河市", "parent_id": "230000"},
            "231000": {"id": "231000", "name": "牡丹江市", "parent_id": "230000"},
            "231100": {"id": "231100", "name": "黑河市", "parent_id": "230000"},
            "231200": {"id": "231200", "name": "绥化市", "parent_id": "230000"},
            "232700": {"id": "232700", "name": "大兴安岭地区", "parent_id": "230000"}
        }
    }]
}, {
    "name": "华东地区",
    "range": [300000, 380000],
    "list": [{
        "id": "310000",
        "name": "上海",
        "parent_id": "0",
        "sub": {"310100": {"id": "310100", "name": "上海市", "parent_id": "310000"}}
    }, {
        "id": "320000",
        "name": "江苏",
        "parent_id": "0",
        "sub": {
            "320100": {"id": "320100", "name": "南京市", "parent_id": "320000"},
            "320200": {"id": "320200", "name": "无锡市", "parent_id": "320000"},
            "320300": {"id": "320300", "name": "徐州市", "parent_id": "320000"},
            "320400": {"id": "320400", "name": "常州市", "parent_id": "320000"},
            "320500": {"id": "320500", "name": "苏州市", "parent_id": "320000"},
            "320600": {"id": "320600", "name": "南通市", "parent_id": "320000"},
            "320700": {"id": "320700", "name": "连云港市", "parent_id": "320000"},
            "320800": {"id": "320800", "name": "淮安市", "parent_id": "320000"},
            "320900": {"id": "320900", "name": "盐城市", "parent_id": "320000"},
            "321000": {"id": "321000", "name": "扬州市", "parent_id": "320000"},
            "321100": {"id": "321100", "name": "镇江市", "parent_id": "320000"},
            "321200": {"id": "321200", "name": "泰州市", "parent_id": "320000"},
            "321300": {"id": "321300", "name": "宿迁市", "parent_id": "320000"}
        }
    }, {
        "id": "330000",
        "name": "浙江",
        "parent_id": "0",
        "sub": {
            "330100": {"id": "330100", "name": "杭州市", "parent_id": "330000"},
            "330200": {"id": "330200", "name": "宁波市", "parent_id": "330000"},
            "330300": {"id": "330300", "name": "温州市", "parent_id": "330000"},
            "330400": {"id": "330400", "name": "嘉兴市", "parent_id": "330000"},
            "330500": {"id": "330500", "name": "湖州市", "parent_id": "330000"},
            "330600": {"id": "330600", "name": "绍兴市", "parent_id": "330000"},
            "330700": {"id": "330700", "name": "金华市", "parent_id": "330000"},
            "330800": {"id": "330800", "name": "衢州市", "parent_id": "330000"},
            "330900": {
                "id": "330900",
                "name": "舟山市",
                "parent_id": "330000"
            },
            "331000": {
                "id": "331000",
                "name": "台州市",
                "parent_id": "330000"
            },
            "331100": {
                "id": "331100",
                "name": "丽水市",
                "parent_id": "330000"
            }
        }
    }, {
        "id": "340000",
        "name": "安徽",
        "parent_id": "0",
        "sub": {
            "340100": {
                "id": "340100",
                "name": "合肥市",
                "parent_id": "340000"
            },
            "340200": {
                "id": "340200",
                "name": "芜湖市",
                "parent_id": "340000"
            },
            "340300": {
                "id": "340300",
                "name": "蚌埠市",
                "parent_id": "340000"
            },
            "340400": {
                "id": "340400",
                "name": "淮南市",
                "parent_id": "340000"
            },
            "340500": {
                "id": "340500",
                "name": "马鞍山市",
                "parent_id": "340000"
            },
            "340600": {
                "id": "340600",
                "name": "淮北市",
                "parent_id": "340000"
            },
            "340700": {
                "id": "340700",
                "name": "铜陵市",
                "parent_id": "340000"
            },
            "340800": {
                "id": "340800",
                "name": "安庆市",
                "parent_id": "340000"
            },
            "341000": {
                "id": "341000",
                "name": "黄山市",
                "parent_id": "340000"
            },
            "341100": {
                "id": "341100",
                "name": "滁州市",
                "parent_id": "340000"
            },
            "341200": {
                "id": "341200",
                "name": "阜阳市",
                "parent_id": "340000"
            },
            "341300": {
                "id": "341300",
                "name": "宿州市",
                "parent_id": "340000"
            },
            "341400": {
                "id": "341400",
                "name": "巢湖市",
                "parent_id": "340000"
            },
            "341500": {
                "id": "341500",
                "name": "六安市",
                "parent_id": "340000"
            },
            "341600": {
                "id": "341600",
                "name": "亳州市",
                "parent_id": "340000"
            },
            "341700": {
                "id": "341700",
                "name": "池州市",
                "parent_id": "340000"
            },
            "341800": {
                "id": "341800",
                "name": "宣城市",
                "parent_id": "340000"
            }
        }
    }, {
        "id": "350000",
        "name": "福建",
        "parent_id": "0",
        "sub": {
            "350100": {
                "id": "350100",
                "name": "福州市",
                "parent_id": "350000"
            },
            "350200": {
                "id": "350200",
                "name": "厦门市",
                "parent_id": "350000"
            },
            "350300": {
                "id": "350300",
                "name": "莆田市",
                "parent_id": "350000"
            },
            "350400": {
                "id": "350400",
                "name": "三明市",
                "parent_id": "350000"
            },
            "350500": {
                "id": "350500",
                "name": "泉州市",
                "parent_id": "350000"
            },
            "350600": {
                "id": "350600",
                "name": "漳州市",
                "parent_id": "350000"
            },
            "350700": {
                "id": "350700",
                "name": "南平市",
                "parent_id": "350000"
            },
            "350800": {
                "id": "350800",
                "name": "龙岩市",
                "parent_id": "350000"
            },
            "350900": {
                "id": "350900",
                "name": "宁德市",
                "parent_id": "350000"
            }
        }
    }, {
        "id": "360000",
        "name": "江西",
        "parent_id": "0",
        "sub": {
            "360100": {
                "id": "360100",
                "name": "南昌市",
                "parent_id": "360000"
            },
            "360200": {
                "id": "360200",
                "name": "景德镇市",
                "parent_id": "360000"
            },
            "360300": {
                "id": "360300",
                "name": "萍乡市",
                "parent_id": "360000"
            },
            "360400": {
                "id": "360400",
                "name": "九江市",
                "parent_id": "360000"
            },
            "360500": {
                "id": "360500",
                "name": "新余市",
                "parent_id": "360000"
            },
            "360600": {
                "id": "360600",
                "name": "鹰潭市",
                "parent_id": "360000"
            },
            "360700": {
                "id": "360700",
                "name": "赣州市",
                "parent_id": "360000"
            },
            "360800": {
                "id": "360800",
                "name": "吉安市",
                "parent_id": "360000"
            },
            "360900": {
                "id": "360900",
                "name": "宜春市",
                "parent_id": "360000"
            },
            "361000": {
                "id": "361000",
                "name": "抚州市",
                "parent_id": "360000"
            },
            "361100": {
                "id": "361100",
                "name": "上饶市",
                "parent_id": "360000"
            }
        }
    }, {
        "id": "370000",
        "name": "山东",
        "parent_id": "0",
        "sub": {
            "370100": {
                "id": "370100",
                "name": "济南市",
                "parent_id": "370000"
            },
            "370200": {
                "id": "370200",
                "name": "青岛市",
                "parent_id": "370000"
            },
            "370300": {
                "id": "370300",
                "name": "淄博市",
                "parent_id": "370000"
            },
            "370400": {
                "id": "370400",
                "name": "枣庄市",
                "parent_id": "370000"
            },
            "370500": {
                "id": "370500",
                "name": "东营市",
                "parent_id": "370000"
            },
            "370600": {
                "id": "370600",
                "name": "烟台市",
                "parent_id": "370000"
            },
            "370700": {
                "id": "370700",
                "name": "潍坊市",
                "parent_id": "370000"
            },
            "370800": {
                "id": "370800",
                "name": "济宁市",
                "parent_id": "370000"
            },
            "370900": {
                "id": "370900",
                "name": "泰安市",
                "parent_id": "370000"
            },
            "371000": {
                "id": "371000",
                "name": "威海市",
                "parent_id": "370000"
            },
            "371100": {
                "id": "371100",
                "name": "日照市",
                "parent_id": "370000"
            },
            "371200": {
                "id": "371200",
                "name": "莱芜市",
                "parent_id": "370000"
            },
            "371300": {
                "id": "371300",
                "name": "临沂市",
                "parent_id": "370000"
            },
            "371400": {
                "id": "371400",
                "name": "德州市",
                "parent_id": "370000"
            },
            "371500": {
                "id": "371500",
                "name": "聊城市",
                "parent_id": "370000"
            },
            "371600": {
                "id": "371600",
                "name": "滨州市",
                "parent_id": "370000"
            },
            "371700": {
                "id": "371700",
                "name": "菏泽市",
                "parent_id": "370000"
            }
        }
    }]
}, {
    "name": "华中地区",
    "range": [400000, 439999],
    "list": [{
        "id": "410000",
        "name": "河南",
        "parent_id": "0",
        "sub": {
            "410881": {"id": "410881", "name": "济源市", "parent_id": "410000"},
            "410100": {
                "id": "410100",
                "name": "郑州市",
                "parent_id": "410000"
            },
            "410200": {
                "id": "410200",
                "name": "开封市",
                "parent_id": "410000"
            },
            "410300": {
                "id": "410300",
                "name": "洛阳市",
                "parent_id": "410000"
            },
            "410400": {
                "id": "410400",
                "name": "平顶山市",
                "parent_id": "410000"
            },
            "410500": {
                "id": "410500",
                "name": "安阳市",
                "parent_id": "410000"
            },
            "410600": {
                "id": "410600",
                "name": "鹤壁市",
                "parent_id": "410000"
            },
            "410700": {
                "id": "410700",
                "name": "新乡市",
                "parent_id": "410000"
            },
            "410800": {
                "id": "410800",
                "name": "焦作市",
                "parent_id": "410000"
            },
            "410900": {
                "id": "410900",
                "name": "濮阳市",
                "parent_id": "410000"
            },
            "411000": {
                "id": "411000",
                "name": "许昌市",
                "parent_id": "410000"
            },
            "411100": {
                "id": "411100",
                "name": "漯河市",
                "parent_id": "410000"
            },
            "411200": {
                "id": "411200",
                "name": "三门峡市",
                "parent_id": "410000"
            },
            "411300": {
                "id": "411300",
                "name": "南阳市",
                "parent_id": "410000"
            },
            "411400": {
                "id": "411400",
                "name": "商丘市",
                "parent_id": "410000"
            },
            "411500": {
                "id": "411500",
                "name": "信阳市",
                "parent_id": "410000"
            },
            "411600": {
                "id": "411600",
                "name": "周口市",
                "parent_id": "410000"
            },
            "411700": {
                "id": "411700",
                "name": "驻马店市",
                "parent_id": "410000"
            }
        }
    }, {
        "id": "420000",
        "name": "湖北",
        "parent_id": "0",
        "sub": {
            "429004": {"id": "429004", "name": "仙桃市", "parent_id": "420000"},
            "429005": {"id": "429005", "name": "潜江市", "parent_id": "420000"},
            "429006": {"id": "429006", "name": "天门市", "parent_id": "420000"},
            "429021": {"id": "429021", "name": "神农架林区", "parent_id": "420000"},
            "420100": {
                "id": "420100",
                "name": "武汉市",
                "parent_id": "420000"
            },
            "420200": {
                "id": "420200",
                "name": "黄石市",
                "parent_id": "420000"
            },
            "420300": {
                "id": "420300",
                "name": "十堰市",
                "parent_id": "420000"
            },
            "420500": {
                "id": "420500",
                "name": "宜昌市",
                "parent_id": "420000"
            },
            "420600": {
                "id": "420600",
                "name": "襄樊市",
                "parent_id": "420000"
            },
            "420700": {
                "id": "420700",
                "name": "鄂州市",
                "parent_id": "420000"
            },
            "420800": {
                "id": "420800",
                "name": "荆门市",
                "parent_id": "420000"
            },
            "420900": {
                "id": "420900",
                "name": "孝感市",
                "parent_id": "420000"
            },
            "421000": {
                "id": "421000",
                "name": "荆州市",
                "parent_id": "420000"
            },
            "421100": {
                "id": "421100",
                "name": "黄冈市",
                "parent_id": "420000"
            },
            "421200": {
                "id": "421200",
                "name": "咸宁市",
                "parent_id": "420000"
            },
            "421300": {
                "id": "421300",
                "name": "随州市",
                "parent_id": "420000"
            },
            "422800": {
                "id": "422800",
                "name": "恩施土家族苗族自治州",
                "parent_id": "420000"
            }
        }
    }, {
        "id": "430000",
        "name": "湖南",
        "parent_id": "0",
        "sub": {
            "430100": {
                "id": "430100",
                "name": "长沙市",
                "parent_id": "430000"
            },
            "430200": {
                "id": "430200",
                "name": "株洲市",
                "parent_id": "430000"
            },
            "430300": {
                "id": "430300",
                "name": "湘潭市",
                "parent_id": "430000"
            },
            "430400": {
                "id": "430400",
                "name": "衡阳市",
                "parent_id": "430000"
            },
            "430500": {
                "id": "430500",
                "name": "邵阳市",
                "parent_id": "430000"
            },
            "430600": {
                "id": "430600",
                "name": "岳阳市",
                "parent_id": "430000"
            },
            "430700": {
                "id": "430700",
                "name": "常德市",
                "parent_id": "430000"
            },
            "430800": {
                "id": "430800",
                "name": "张家界市",
                "parent_id": "430000"
            },
            "430900": {
                "id": "430900",
                "name": "益阳市",
                "parent_id": "430000"
            },
            "431000": {
                "id": "431000",
                "name": "郴州市",
                "parent_id": "430000"
            },
            "431100": {
                "id": "431100",
                "name": "永州市",
                "parent_id": "430000"
            },
            "431200": {
                "id": "431200",
                "name": "怀化市",
                "parent_id": "430000"
            },
            "431300": {
                "id": "431300",
                "name": "娄底市",
                "parent_id": "430000"
            },
            "433100": {
                "id": "433100",
                "name": "湘西土家族苗族自治州",
                "parent_id": "430000"
            }
        }
    }]
}, {
    "name": "华南地区",
    "range": [440000, 470000],
    "list": [{
        "id": "440000",
        "name": "广东",
        "parent_id": "0",
        "sub": {
            "440100": {
                "id": "440100",
                "name": "广州市",
                "parent_id": "440000"
            },
            "440200": {
                "id": "440200",
                "name": "韶关市",
                "parent_id": "440000"
            },
            "440300": {
                "id": "440300",
                "name": "深圳市",
                "parent_id": "440000"
            },
            "440400": {
                "id": "440400",
                "name": "珠海市",
                "parent_id": "440000"
            },
            "440500": {
                "id": "440500",
                "name": "汕头市",
                "parent_id": "440000"
            },
            "440600": {
                "id": "440600",
                "name": "佛山市",
                "parent_id": "440000"
            },
            "440700": {
                "id": "440700",
                "name": "江门市",
                "parent_id": "440000"
            },
            "440800": {
                "id": "440800",
                "name": "湛江市",
                "parent_id": "440000"
            },
            "440900": {
                "id": "440900",
                "name": "茂名市",
                "parent_id": "440000"
            },
            "441200": {
                "id": "441200",
                "name": "肇庆市",
                "parent_id": "440000"
            },
            "441300": {
                "id": "441300",
                "name": "惠州市",
                "parent_id": "440000"
            },
            "441400": {
                "id": "441400",
                "name": "梅州市",
                "parent_id": "440000"
            },
            "441500": {
                "id": "441500",
                "name": "汕尾市",
                "parent_id": "440000"
            },
            "441600": {
                "id": "441600",
                "name": "河源市",
                "parent_id": "440000"
            },
            "441700": {
                "id": "441700",
                "name": "阳江市",
                "parent_id": "440000"
            },
            "441800": {
                "id": "441800",
                "name": "清远市",
                "parent_id": "440000"
            },
            "441900": {"id": "441900", "name": "东莞市", "parent_id": "440000"},
            "442000": {"id": "442000", "name": "中山市", "parent_id": "440000"},
            "445100": {
                "id": "445100",
                "name": "潮州市",
                "parent_id": "440000"
            },
            "445200": {
                "id": "445200",
                "name": "揭阳市",
                "parent_id": "440000"
            },
            "445300": {
                "id": "445300",
                "name": "云浮市",
                "parent_id": "440000"
            }
        }
    }, {
        "id": "450000",
        "name": "广西",
        "parent_id": "0",
        "sub": {
            "450100": {
                "id": "450100",
                "name": "南宁市",
                "parent_id": "450000"
            },
            "450200": {
                "id": "450200",
                "name": "柳州市",
                "parent_id": "450000"
            },
            "450300": {
                "id": "450300",
                "name": "桂林市",
                "parent_id": "450000"
            },
            "450400": {
                "id": "450400",
                "name": "梧州市",
                "parent_id": "450000"
            },
            "450500": {
                "id": "450500",
                "name": "北海市",
                "parent_id": "450000"
            },
            "450600": {
                "id": "450600",
                "name": "防城港市",
                "parent_id": "450000"
            },
            "450700": {
                "id": "450700",
                "name": "钦州市",
                "parent_id": "450000"
            },
            "450800": {
                "id": "450800",
                "name": "贵港市",
                "parent_id": "450000"
            },
            "450900": {
                "id": "450900",
                "name": "玉林市",
                "parent_id": "450000"
            },
            "451000": {
                "id": "451000",
                "name": "百色市",
                "parent_id": "450000"
            },
            "451100": {
                "id": "451100",
                "name": "贺州市",
                "parent_id": "450000"
            },
            "451200": {
                "id": "451200",
                "name": "河池市",
                "parent_id": "450000"
            },
            "451300": {
                "id": "451300",
                "name": "来宾市",
                "parent_id": "450000"
            },
            "451400": {
                "id": "451400",
                "name": "崇左市",
                "parent_id": "450000"
            }
        }
    }, {
        "id": "460000",
        "name": "海南",
        "parent_id": "0",
        "sub": {
            "469001": {"id": "469001", "name": "五指山市", "parent_id": "460000"},
            "469002": {"id": "469002", "name": "琼海市", "parent_id": "460000"},
            "469003": {"id": "469003", "name": "儋州市", "parent_id": "460000"},
            "469005": {"id": "469005", "name": "文昌市", "parent_id": "460000"},
            "469006": {"id": "469006", "name": "万宁市", "parent_id": "460000"},
            "469007": {"id": "469007", "name": "东方市", "parent_id": "460000"},
            "469025": {"id": "469025", "name": "定安县", "parent_id": "460000"},
            "469026": {"id": "469026", "name": "屯昌县", "parent_id": "460000"},
            "469027": {"id": "469027", "name": "澄迈县", "parent_id": "460000"},
            "469028": {"id": "469028", "name": "临高县", "parent_id": "460000"},
            "469030": {"id": "469030", "name": "白沙县", "parent_id": "460000"},
            "469031": {"id": "469031", "name": "昌江县", "parent_id": "460000"},
            "469033": {"id": "469033", "name": "乐东县", "parent_id": "460000"},
            "469034": {"id": "469034", "name": "陵水县", "parent_id": "460000"},
            "469035": {"id": "469035", "name": "保亭县", "parent_id": "460000"},
            "469036": {"id": "469036", "name": "琼中县", "parent_id": "460000"},
            "469037": {"id": "469037", "name": "西沙群岛办事处(县级)", "parent_id": "460000"},
            "469038": {"id": "469038", "name": "南沙群岛办事处(县级)", "parent_id": "460000"},
            "469039": {"id": "469039", "name": "中沙群岛办事处(县级)", "parent_id": "460000"},
            "460100": {
                "id": "460100",
                "name": "海口市",
                "parent_id": "460000"
            },
            "460200": {
                "id": "460200",
                "name": "三亚市",
                "parent_id": "460000",
                "sub": {"460201": {"id": "460201", "name": "三亚市", "parent_id": "460200"}}
            }
        }
    }]
}, {
    "name": "西南地区",
    "range": [500000, 550000],
    "list": [{
        "id": "500000",
        "name": "重庆",
        "parent_id": "0",
        "sub": {
            "500100": {
                "id": "500100",
                "name": "重庆市",
                "parent_id": "500000"
            }
        }
    }, {
        "id": "510000",
        "name": "四川",
        "parent_id": "0",
        "sub": {
            "510100": {
                "id": "510100",
                "name": "成都市",
                "parent_id": "510000"
            },
            "510300": {
                "id": "510300",
                "name": "自贡市",
                "parent_id": "510000"
            },
            "510400": {
                "id": "510400",
                "name": "攀枝花市",
                "parent_id": "510000"
            },
            "510500": {
                "id": "510500",
                "name": "泸州市",
                "parent_id": "510000"
            },
            "510600": {
                "id": "510600",
                "name": "德阳市",
                "parent_id": "510000"
            },
            "510700": {
                "id": "510700",
                "name": "绵阳市",
                "parent_id": "510000"
            },
            "510800": {
                "id": "510800",
                "name": "广元市",
                "parent_id": "510000"
            },
            "510900": {
                "id": "510900",
                "name": "遂宁市",
                "parent_id": "510000"
            },
            "511000": {
                "id": "511000",
                "name": "内江市",
                "parent_id": "510000"
            },
            "511100": {
                "id": "511100",
                "name": "乐山市",
                "parent_id": "510000"
            },
            "511300": {
                "id": "511300",
                "name": "南充市",
                "parent_id": "510000"
            },
            "511400": {
                "id": "511400",
                "name": "眉山市",
                "parent_id": "510000"
            },
            "511500": {
                "id": "511500",
                "name": "宜宾市",
                "parent_id": "510000"
            },
            "511600": {
                "id": "511600",
                "name": "广安市",
                "parent_id": "510000"
            },
            "511700": {
                "id": "511700",
                "name": "达州市",
                "parent_id": "510000"
            },
            "511800": {
                "id": "511800",
                "name": "雅安市",
                "parent_id": "510000"
            },
            "511900": {
                "id": "511900",
                "name": "巴中市",
                "parent_id": "510000"
            },
            "512000": {
                "id": "512000",
                "name": "资阳市",
                "parent_id": "510000"
            },
            "513200": {
                "id": "513200",
                "name": "阿坝藏族羌族自治州",
                "parent_id": "510000"
            },
            "513300": {
                "id": "513300",
                "name": "甘孜藏族自治州",
                "parent_id": "510000"
            },
            "513400": {
                "id": "513400",
                "name": "凉山彝族自治州",
                "parent_id": "510000"
            }
        }
    }, {
        "id": "520000",
        "name": "贵州",
        "parent_id": "0",
        "sub": {
            "520100": {
                "id": "520100",
                "name": "贵阳市",
                "parent_id": "520000"
            },
            "520200": {
                "id": "520200",
                "name": "六盘水市",
                "parent_id": "520000"
            },
            "520300": {
                "id": "520300",
                "name": "遵义市",
                "parent_id": "520000"
            },
            "520400": {
                "id": "520400",
                "name": "安顺市",
                "parent_id": "520000"
            },
            "522200": {
                "id": "522200",
                "name": "铜仁地区",
                "parent_id": "520000"
            },
            "522300": {
                "id": "522300",
                "name": "黔西南布依族苗族自治州",
                "parent_id": "520000"
            },
            "522400": {
                "id": "522400",
                "name": "毕节地区",
                "parent_id": "520000"
            },
            "522600": {
                "id": "522600",
                "name": "黔东南苗族侗族自治州",
                "parent_id": "520000"
            },
            "522700": {
                "id": "522700",
                "name": "黔南布依族苗族自治州",
                "parent_id": "520000"
            }
        }
    }, {
        "id": "530000",
        "name": "云南",
        "parent_id": "0",
        "sub": {
            "530100": {
                "id": "530100",
                "name": "昆明市",
                "parent_id": "530000"
            },
            "530300": {
                "id": "530300",
                "name": "曲靖市",
                "parent_id": "530000"
            },
            "530400": {
                "id": "530400",
                "name": "玉溪市",
                "parent_id": "530000"
            },
            "530500": {
                "id": "530500",
                "name": "保山市",
                "parent_id": "530000"
            },
            "530600": {
                "id": "530600",
                "name": "昭通市",
                "parent_id": "530000"
            },
            "530700": {
                "id": "530700",
                "name": "丽江市",
                "parent_id": "530000"
            },
            "530800": {
                "id": "530800",
                "name": "思茅市",
                "parent_id": "530000"
            },
            "530900": {
                "id": "530900",
                "name": "临沧市",
                "parent_id": "530000"
            },
            "532300": {
                "id": "532300",
                "name": "楚雄彝族自治州",
                "parent_id": "530000"
            },
            "532500": {
                "id": "532500",
                "name": "红河哈尼族彝族自治州",
                "parent_id": "530000"
            },
            "532600": {
                "id": "532600",
                "name": "文山壮族苗族自治州",
                "parent_id": "530000"
            },
            "532800": {
                "id": "532800",
                "name": "西双版纳傣族自治州",
                "parent_id": "530000"
            },
            "532900": {
                "id": "532900",
                "name": "大理白族自治州",
                "parent_id": "530000"
            },
            "533100": {
                "id": "533100",
                "name": "德宏傣族景颇族自治州",
                "parent_id": "530000"
            },
            "533300": {
                "id": "533300",
                "name": "怒江傈僳族自治州",
                "parent_id": "530000"
            },
            "533400": {
                "id": "533400",
                "name": "迪庆藏族自治州",
                "parent_id": "530000"
            }
        }
    }, {
        "id": "540000",
        "name": "西藏",
        "parent_id": "0",
        "sub": {
            "540100": {
                "id": "540100",
                "name": "拉萨市",
                "parent_id": "540000"
            },
            "542100": {
                "id": "542100",
                "name": "昌都地区",
                "parent_id": "540000"
            },
            "542200": {
                "id": "542200",
                "name": "山南地区",
                "parent_id": "540000"
            },
            "542300": {
                "id": "542300",
                "name": "日喀则地区",
                "parent_id": "540000"
            },
            "542400": {
                "id": "542400",
                "name": "那曲地区",
                "parent_id": "540000"
            },
            "542500": {
                "id": "542500",
                "name": "阿里地区",
                "parent_id": "540000"
            },
            "542600": {
                "id": "542600",
                "name": "林芝地区",
                "parent_id": "540000"
            }
        }
    }]
}, {
    "name": "西北地区",
    "range": [600000, 660000],
    "list": [{
        "id": "610000",
        "name": "陕西",
        "parent_id": "0",
        "sub": {
            "610100": {
                "id": "610100",
                "name": "西安市",
                "parent_id": "610000"
            },
            "610200": {
                "id": "610200",
                "name": "铜川市",
                "parent_id": "610000"
            },
            "610300": {
                "id": "610300",
                "name": "宝鸡市",
                "parent_id": "610000"
            },
            "610400": {
                "id": "610400",
                "name": "咸阳市",
                "parent_id": "610000"
            },
            "610500": {
                "id": "610500",
                "name": "渭南市",
                "parent_id": "610000"
            },
            "610600": {
                "id": "610600",
                "name": "延安市",
                "parent_id": "610000"
            },
            "610700": {
                "id": "610700",
                "name": "汉中市",
                "parent_id": "610000"
            },
            "610800": {
                "id": "610800",
                "name": "榆林市",
                "parent_id": "610000"
            },
            "610900": {
                "id": "610900",
                "name": "安康市",
                "parent_id": "610000"
            },
            "611000": {
                "id": "611000",
                "name": "商洛市",
                "parent_id": "610000"
            }
        }
    }, {
        "id": "620000",
        "name": "甘肃",
        "parent_id": "0",
        "sub": {
            "620100": {
                "id": "620100",
                "name": "兰州市",
                "parent_id": "620000"
            },
            "620200": {
                "id": "620200",
                "name": "嘉峪关市",
                "parent_id": "620000",
            },
            "620300": {
                "id": "620300",
                "name": "金昌市",
                "parent_id": "620000"
            },
            "620400": {
                "id": "620400",
                "name": "白银市",
                "parent_id": "620000"
            },
            "620500": {
                "id": "620500",
                "name": "天水市",
                "parent_id": "620000"
            },
            "620600": {
                "id": "620600",
                "name": "武威市",
                "parent_id": "620000"
            },
            "620700": {
                "id": "620700",
                "name": "张掖市",
                "parent_id": "620000"
            },
            "620800": {
                "id": "620800",
                "name": "平凉市",
                "parent_id": "620000"
            },
            "620900": {
                "id": "620900",
                "name": "酒泉市",
                "parent_id": "620000"
            },
            "621000": {
                "id": "621000",
                "name": "庆阳市",
                "parent_id": "620000"
            },
            "621100": {
                "id": "621100",
                "name": "定西市",
                "parent_id": "620000"
            },
            "621200": {
                "id": "621200",
                "name": "陇南市",
                "parent_id": "620000"
            },
            "622900": {
                "id": "622900",
                "name": "临夏回族自治州",
                "parent_id": "620000"
            },
            "623000": {
                "id": "623000",
                "name": "甘南藏族自治州",
                "parent_id": "620000"
            }
        }
    }, {
        "id": "630000",
        "name": "青海",
        "parent_id": "0",
        "sub": {
            "630100": {
                "id": "630100",
                "name": "西宁市",
                "parent_id": "630000"
            },
            "632100": {
                "id": "632100",
                "name": "海东地区",
                "parent_id": "630000"
            },
            "632200": {
                "id": "632200",
                "name": "海北藏族自治州",
                "parent_id": "630000"
            },
            "632300": {
                "id": "632300",
                "name": "黄南藏族自治州",
                "parent_id": "630000"
            },
            "632500": {
                "id": "632500",
                "name": "海南藏族自治州",
                "parent_id": "630000"
            },
            "632600": {
                "id": "632600",
                "name": "果洛藏族自治州",
                "parent_id": "630000"
            },
            "632700": {
                "id": "632700",
                "name": "玉树藏族自治州",
                "parent_id": "630000"
            },
            "632800": {
                "id": "632800",
                "name": "海西蒙古族藏族自治州",
                "parent_id": "630000"
            }
        }
    }, {
        "id": "640000",
        "name": "宁夏",
        "parent_id": "0",
        "sub": {
            "640100": {
                "id": "640100",
                "name": "银川市",
                "parent_id": "640000"
            },
            "640200": {
                "id": "640200",
                "name": "石嘴山市",
                "parent_id": "640000"
            },
            "640300": {
                "id": "640300",
                "name": "吴忠市",
                "parent_id": "640000"
            },
            "640400": {
                "id": "640400",
                "name": "固原市",
                "parent_id": "640000"
            },
            "640500": {
                "id": "640500",
                "name": "中卫市",
                "parent_id": "640000"
            }
        }
    }, {
        "id": "650000",
        "name": "新疆",
        "parent_id": "0",
        "sub": {
            "659001": {"id": "659001", "name": "石河子市", "parent_id": "650000"},
            "659002": {"id": "659002", "name": "阿拉尔市", "parent_id": "650000"},
            "659003": {"id": "659003", "name": "图木舒克市", "parent_id": "650000"},
            "659004": {"id": "659004", "name": "五家渠市", "parent_id": "650000"},
            "650100": {
                "id": "650100",
                "name": "乌鲁木齐市",
                "parent_id": "650000"
            },
            "650200": {
                "id": "650200",
                "name": "克拉玛依市",
                "parent_id": "650000"
            },
            "652100": {
                "id": "652100",
                "name": "吐鲁番地区",
                "parent_id": "650000"
            },
            "652200": {
                "id": "652200",
                "name": "哈密地区",
                "parent_id": "650000"
            },
            "652300": {
                "id": "652300",
                "name": "昌吉回族自治州",
                "parent_id": "650000"
            },
            "652700": {
                "id": "652700",
                "name": "博尔塔拉蒙古自治州",
                "parent_id": "650000"
            },
            "652800": {
                "id": "652800",
                "name": "巴音郭楞蒙古自治州",
                "parent_id": "650000"
            },
            "652900": {
                "id": "652900",
                "name": "阿克苏地区",
                "parent_id": "650000"
            },
            "653000": {
                "id": "653000",
                "name": "克孜勒苏柯尔克孜自治州",
                "parent_id": "650000"
            },
            "653100": {
                "id": "653100",
                "name": "喀什地区",
                "parent_id": "650000"
            },
            "653200": {
                "id": "653200",
                "name": "和田地区",
                "parent_id": "650000"
            },
            "654000": {
                "id": "654000",
                "name": "伊犁哈萨克自治州",
                "parent_id": "650000"
            },
            "654200": {
                "id": "654200",
                "name": "塔城地区",
                "parent_id": "650000"
            },
            "654300": {
                "id": "654300",
                "name": "阿勒泰地区",
                "parent_id": "650000"
            }
        }
    }]
}, {
    "name": "台湾地区",
    "range": [700000, 720000],
    "list": [{
        "id": "710000",
        "name": "台湾",
        "parent_id": "0",
        "sub": {
            "711000": {"id": "711000", "name": "台北市", "parent_id": "710000"},
            "711100": {"id": "711100", "name": "台中市", "parent_id": "710000"},
            "711200": {"id": "711200", "name": "南投市", "parent_id": "710000"},
            "711300": {"id": "711300", "name": "台南市", "parent_id": "710000"},
            "711400": {"id": "711400", "name": "高雄市", "parent_id": "710000"},
            "711500": {"id": "711500", "name": "新北市", "parent_id": "710000"},
            "711600": {"id": "711600", "name": "彰化市", "parent_id": "710000"},
            "711700": {"id": "711700", "name": "桃园县", "parent_id": "710000"},
            "711800": {"id": "711800", "name": "新竹县", "parent_id": "710000"},
            "711900": {"id": "711900", "name": "苗栗县", "parent_id": "710000"},
            "712000": {"id": "712000", "name": "台中县", "parent_id": "710000"},
            "712100": {"id": "712100", "name": "南投县", "parent_id": "710000"},
            "712200": {"id": "712200", "name": "彰化县", "parent_id": "710000"},
            "712300": {"id": "712300", "name": "云林县", "parent_id": "710000"},
            "712400": {"id": "712400", "name": "嘉义县", "parent_id": "710000"},
            "712500": {"id": "712500", "name": "台南县", "parent_id": "710000"},
            "712600": {"id": "712600", "name": "高雄县", "parent_id": "710000"},
            "713400": {"id": "713400", "name": "嘉义市", "parent_id": "710000"},
            "713500": {"id": "713500", "name": "新竹市", "parent_id": "710000"}
        }
    }]
}, {
    "name": "港澳地区",
    "range": [800000, 830000],
    "list": [{
        "id": "810000",
        "name": "香港",
        "parent_id": "0",
        "sub": {"810100": {"id": "810100", "name": "香港特别行政区", "parent_id": "810000"}}
    }, {
        "id": "820000",
        "name": "澳门",
        "parent_id": "0",
        "sub": {"820100": {"id": "820100", "name": "澳门特别行政区", "parent_id": "820000"}}
    }]
}]

export default AreaList;